export const messages = {
    start: (firstname) =>
        `🎮 بازی شروع شد
👤 بازیکن اول: ${firstname}
👥 منتظر بازیکن دوم...`,

    joined: (firstname) =>
        `✅ ${firstname} وارد بازی شد
🚀 بازی آغاز شد`,

    turn: (firstname) =>
        `♟️ حرکت انجام شد
نوبت ${firstname} است`,

    draw: () =>
        `🟰 بازی مساوی شد
هیچ‌کس برنده نشد`,

    win: (firstname) =>
        `🏆 بازی تمام شد
🎉 برنده: ${firstname}`,
    cancel: (firstname) =>
        `⛔ <b>بازی لغو شد</b>

این بازی توسط <b>${firstname}</b> کنسل شد.
برای شروع دوباره /startgame را بزنید`
};
