export const messages = {
    start: (firstname) =>
        `🎮 بازی شروع شد
👤 بازیکن اول: ${firstname}
👥 منتظر بازیکن دوم..
برای پیوستن 
/joingame
را بزنید
.`,

    joined: (firstname) =>
        `✅ ${firstname} وارد بازی شد
🚀 بازی آغاز شد`,

    turn: (firstname) =>
        `♟️ حرکت انجام شد
نوبت ${firstname} است`,

    draw: () =>
        `🟰 بازی مساوی شد
هیچ‌کس برنده نشد`,

    win: (firstname) =>
        `🏆 بازی تمام شد
🎉 برنده: ${firstname}`,
    cancel: (firstname) =>
        `⛔بازی لغو شد

این بازی توسط ${firstname} کنسل شد.
برای شروع دوباره /startgame را بزنید`
};
